#Область ПрограммныйИнтерфейс

// Смотри также ОбновлениеИнформационнойБазыПереопределяемый.ПриНачальномЗаполненииЭлементов
//
// Параметры:
//  КодыЯзыков - см. ОбновлениеИнформационнойБазыПереопределяемый.ПриНачальномЗаполненииЭлементов.КодыЯзыков
//  Элементы   - см. ОбновлениеИнформационнойБазыПереопределяемый.ПриНачальномЗаполненииЭлементов.Элементы
//  ТабличныеЧасти - см. ОбновлениеИнформационнойБазыПереопределяемый.ПриНачальномЗаполненииЭлементов.ТабличныеЧасти
//
Процедура ПриНачальномЗаполненииЭлементов(КодыЯзыков, Элементы, ТабличныеЧасти) Экспорт
	
	// Контактная информация справочника "Клиенты"
	Элемент = Элементы.Добавить(); 
	Элемент.ИмяПредопределенногоВида = "СправочникКлиенты";	
	Элемент.ЭтоГруппа    = Истина;
	Элемент.Используется = Истина;
	Элемент.Наименование = НСтр("ru = 'Контактная информация справочника ""Клиенты""'", ОбщегоНазначения.КодОсновногоЯзыка());
			
	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенногоВида = "EmailКлиента";
	Элемент.Родитель = "СправочникКлиенты";
	Элемент.ИмяГруппы = "СправочникКлиенты";
	Элемент.Тип = Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты;
	Элемент.РазрешитьВводНесколькихЗначений = Истина;
	Элемент.ОтображатьВсегда                = Истина;
	Элемент.Используется                    = Истина;
	Элемент.Наименование = НСтр("ru = 'Электронная почта'", ОбщегоНазначения.КодОсновногоЯзыка());
	
	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенногоВида = "ТелефонКлиента";
	Элемент.Родитель = "СправочникКлиенты";
	Элемент.ИмяГруппы = "СправочникКлиенты";
	Элемент.Тип = Перечисления.ТипыКонтактнойИнформации.Телефон;
	Элемент.МожноИзменятьСпособРедактирования = Истина;
	Элемент.ОтображатьВсегда                  = Истина;
	Элемент.РазрешитьВводНесколькихЗначений   = Истина;
	Элемент.Используется                      = Истина;
	Элемент.Наименование = НСтр("ru = 'Телефон'", ОбщегоНазначения.КодОсновногоЯзыка());
		
	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенногоВида = "МессенджерыКлиента";
	Элемент.Родитель = "СправочникКлиенты";
	Элемент.ИмяГруппы = "СправочникКлиенты";
	Элемент.Тип = Перечисления.ТипыКонтактнойИнформации.Другое;
	Элемент.МожноИзменятьСпособРедактирования = Ложь;
	Элемент.ВидПоляДругое   = "ОднострочноеШирокое";
	Элемент.ОтображатьВсегда                  = Истина;
	Элемент.Используется                      = Истина;
	Элемент.Наименование = НСтр("ru = 'Мессенджеры'", ОбщегоНазначения.КодОсновногоЯзыка());

КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти