#Область ПрограммныйИнтерфейс

// Обработчик обновления для переноса пользователей из справочника, созданного до внедрения БСП
//
Процедура ПеренестиПользователейИзПредыдущейВерсии() Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	паПользователи.Ссылка,
	|	паПользователи.Наименование,
	|	паПользователи.ИдентификаторПользователяИБ
	|ИЗ
	|	Справочник.паПользователи КАК паПользователи
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Пользователи КАК Пользователи
	|		ПО паПользователи.ИдентификаторПользователяИБ = Пользователи.ИдентификаторПользователяИБ
	|ГДЕ
	|	Пользователи.Ссылка ЕСТЬ NULL
	|	И НЕ паПользователи.ИдентификаторПользователяИБ = &ПустойИдентификатор";

	Запрос.УстановитьПараметр("ПустойИдентификатор", ОбщегоНазначенияКлиентСервер.ПустойУникальныйИдентификатор());

	Выборка = Запрос.Выполнить().Выбрать();

	Пока Выборка.Следующий() Цикл
		НачатьТранзакцию();

		Попытка
			ПользовательИБ = ПользователиИнформационнойБазы.НайтиПоУникальномуИдентификатору(
				Выборка.ИдентификаторПользователяИБ);

			ПользовательОбъект = Справочники.Пользователи.СоздатьЭлемент();
			ПользовательОбъект.Наименование = Выборка.Наименование;

			ОписаниеПользователяИБ = Новый Структура;
			ОписаниеПользователяИБ.Вставить("Действие", "Записать");
			ОписаниеПользователяИБ.Вставить("УникальныйИдентификатор", Выборка.ИдентификаторПользователяИБ);
			ПользовательОбъект.ДополнительныеСвойства.Вставить("ОписаниеПользователяИБ", ОписаниеПользователяИБ);

			ПользовательОбъект.Записать();
			НазначитьПрофилиГруппДоступа(ПользовательОбъект.Ссылка, ПользовательИБ);
			ЗафиксироватьТранзакцию();

		Исключение
			ОтменитьТранзакцию();
			ВызватьИсключение;

		КонецПопытки;

	КонецЦикла;

КонецПроцедуры

// Обработчик обновления для актуализации видов контактной информации
//
Процедура АктуализироватьВидыКонтактнойИнформации() Экспорт

	ПараметрыОбновления = ОбновлениеИнформационнойБазы.ПараметрыОбновленияПредопределенныхЭлементов();
	ПараметрыОбновления.Элементы.Добавить(УправлениеКонтактнойИнформацией.ВидКонтактнойИнформацииПоИмени(
		"ТелефонПользователя"));
	ПараметрыОбновления.Элементы.Добавить(УправлениеКонтактнойИнформацией.ВидКонтактнойИнформацииПоИмени(
		"EmailПользователя"));
	ПараметрыОбновления.Реквизиты = "РазрешитьВводНесколькихЗначений, ВидРедактирования, ОтображатьВсегда";
	ОбновлениеИнформационнойБазы.ОбновитьПредопределенныеЭлементы(Метаданные.Справочники.ВидыКонтактнойИнформации,
		ПараметрыОбновления);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ОбновлениеИБ

Процедура НазначитьПрофилиГруппДоступа(Пользователь, ПользовательИБ)
	
	Если ПользовательИБ = Неопределено Тогда
		Возврат;
	КонецЕсли;

	ЭтоАдминистратор = Ложь;
	ЭтоКассир = Ложь;
	ЭтоОператорАттракционов = Ложь;

	Для Каждого Роль Из ПользовательИБ.Роли Цикл
		Если Роль = Метаданные.Роли.паПолныеПрава Тогда
			ЭтоАдминистратор = Истина;
		ИначеЕсли Роль = Метаданные.Роли.Кассир Тогда
			ЭтоКассир = Истина;
		ИначеЕсли Роль = Метаданные.Роли.ОператорАттракционов Тогда
			ЭтоОператорАттракционов = Истина;
		КонецЕсли;
	КонецЦикла;

	Если ЭтоАдминистратор Тогда
		УправлениеДоступом.ВключитьПрофильПользователю(Пользователь, "Администратор");
	ИначеЕсли ЭтоКассир Тогда
		УправлениеДоступом.ВключитьПрофильПользователю(Пользователь, "Кассир");
	ИначеЕсли ЭтоОператорАттракционов Тогда
		УправлениеДоступом.ВключитьПрофильПользователю(Пользователь, "ОператорАттракционов");
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#КонецОбласти