
#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Выгрузить(Команда)
	
	АдресАрхива = ВыгрузитьНаСервере();
	ПараметрыДиалога = Новый ПараметрыДиалогаПолученияФайлов;
	ПолучитьФайлССервераАсинх(АдресАрхива, "export.zip", ПараметрыДиалога);

КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ВыгрузитьНаСервере()
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	АдресАрхива = ОбработкаОбъект.ПодготовитьАрхив();
	Возврат АдресАрхива;
	
КонецФункции

#КонецОбласти
