#Область ОбработчикиСобытий

Процедура УстановкаПараметровСеанса(ТребуемыеПараметры)
	
		ПользовательИБ = ПользователиИнформационнойБазы.ТекущийПользователь();
		
		Пользователь = Справочники.Пользователи.НайтиПоРеквизиту(
			"ИдентификаторПользователяИБ", 
			ПользовательИБ.УникальныйИдентификатор);
			
		ПараметрыСеанса.ТекущийПользователь = Пользователь;
		
		Если Не ЗначениеЗаполнено(Пользователь) Тогда
			Сообщение = Новый СообщениеПользователю();
			Сообщение.Текст = СтрШаблон(
				"Пользователь <%1> не найден с справочнике <Пользователи>. Обратитесь к Администратору", 
				ПользовательИБ
			);
			Сообщение.Сообщить();
		КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
