

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СформироватьДиаграммуПосещениеАттракционов();
	
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	
	СформироватьДиаграммуПосещениеАттракционов();
	
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиКомандФормы

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура СформироватьДиаграммуПосещениеАттракционов()
	
	ПосещениеАттракционов.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ПосещенияАттракционовОбороты.Период КАК День,
	|	ПосещенияАттракционовОбороты.Аттракцион,
	|	ПосещенияАттракционовОбороты.КоличествоОборот КАК КоличествоПосещений
	|ИЗ
	|	РегистрНакопления.ПосещенияАттракционов.Обороты(&НачалоПериода, &КонецПериода, День,) КАК ПосещенияАттракционовОбороты
	|
	|УПОРЯДОЧИТЬ ПО
	|	День";
	
	Запрос.УстановитьПараметр("НачалоПериода", Период.ДатаНачала);
	Запрос.УстановитьПараметр("КонецПериода" , Период.ДатаОкончания);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Точка = ПосещениеАттракционов.УстановитьТочку(Выборка.День);
		Точка.Текст = Формат(Выборка.День, "ДЛФ=D;");
		Серия = ПосещениеАттракционов.УстановитьСерию(Выборка.Аттракцион);
		ПосещениеАттракционов.УстановитьЗначение(Точка, Серия, Выборка.КоличествоПосещений);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
