#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиСобытий

// Код процедур и функций

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Процедура ПеренестиТелефонВКонтактуюИнформацию(ПараметрыОбработки) Экспорт
	
	ПараметрыОбработки.ОбработкаЗавершена = Ложь;
	
	ВидКИТелефонКлиента = УправлениеКонтактнойИнформацией.ВидКонтактнойИнформацииПоИмени("ТелефонКлиента");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 50
	|	Клиенты.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Клиенты КАК Клиенты
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Клиенты.КонтактнаяИнформация КАК КлиентыКонтактнаяИнформация
	|		ПО КлиентыКонтактнаяИнформация.Ссылка = Клиенты.Ссылка
	|		И КлиентыКонтактнаяИнформация.Вид = &ВидКИТелефонКлиента
	|ГДЕ
	|	Клиенты.НормализованныйТелефон <> """"
	|	И КлиентыКонтактнаяИнформация.Ссылка ЕСТЬ NULL";
	
	Запрос.УстановитьПараметр("ВидКИТелефонКлиента", ВидКИТелефонКлиента);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		ПараметрыОбработки.ОбработкаЗавершена = Истина;
		Возврат;
	КонецЕсли;	
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		СпрОбъект = Выборка.Ссылка.ПолучитьОбъект();
		
		КонтактанаяИнформация = УправлениеКонтактнойИнформацией.НоваяКонтактнаяИнформация();
		ДанныеКИ = КонтактанаяИнформация.Добавить();
		ДанныеКИ.Вид = ВидКИТелефонКлиента;
		ДанныеКИ.Представление = "+" + СпрОбъект.НормализованныйТелефон;
		ДанныеКИ.Объект = СпрОбъект;
		
		УправлениеКонтактнойИнформацией.УстановитьКонтактнуюИнформациюОбъекта(СпрОбъект, КонтактанаяИнформация, Ложь);
		//ОбновлениеИнформационнойБазы.ЗаписатьОбъект(СпрОбъект);
		СпрОбъект.Записать();
			
	КонецЦикла;
	
КонецПроцедуры


#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти

#КонецЕсли
